Revit 2027 API
BuiltInFailures.RoomFailures.RoomTagNotInRoom Property
 [Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomTagNotInRoom { get; }
Public Shared ReadOnly Property RoomTagNotInRoom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomTagNotInRoom {
	FailureDefinitionId^ get ();
}
static member RoomTagNotInRoom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace